speters/CMSIS/Device/TI/LM4F/Source/ARM/startup_LM4F.s
;/**************************************************************************//**
; * @file     startup_LM4F.s
; * @brief    CMSIS Cortex-M4 Core Device Startup File for
; *           TI Stellaris
; * @version  V3.00
; * @date     19. December 2011
; *
; * @note
; * Copyright (C) 2011 ARM Limited. All rights reserved.
; *
; * @par
; * ARM Limited (ARM) is supplying this software for use with Cortex-M
; * processor based microcontrollers.  This file can be freely distributed
; * within development tools that are supporting such ARM based processors.
; *
; * @par
; * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
; * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
; * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
; * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
; * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
; *
; ******************************************************************************/
;/*
;//-------- <<< Use Configuration Wizard in Context Menu >>> ------------------
;*/


; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x00000400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Heap_Size       EQU     0x00000100

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts

                DCD     GPIOA_Handler             ; GPIO Port A
                DCD     GPIOB_Handler             ; GPIO Port B
                DCD     GPIOC_Handler             ; GPIO Port C
                DCD     GPIOD_Handler             ; GPIO Port D
                DCD     GPIOE_Handler             ; GPIO Port E
                DCD     UART0_Handler             ; UART0 Rx and Tx
                DCD     UART1_Handler             ; UART1 Rx and Tx
                DCD     SSI0_Handler              ; SSI0 Rx and Tx
                DCD     I2C0_Handler              ; I2C0 Master and Slave
                DCD     PMW0_FAULT_Handler        ; PWM Fault
                DCD     PWM0_0_Handler            ; PWM Generator 0
                DCD     PWM0_1_Handler            ; PWM Generator 1
                DCD     PWM0_2_Handler            ; PWM Generator 2
                DCD     QEI0_Handler              ; Quadrature Encoder 0
                DCD     ADC0SS0_Handler           ; ADC Sequence 0
                DCD     ADC0SS1_Handler           ; ADC Sequence 1
                DCD     ADC0SS2_Handler           ; ADC Sequence 2
                DCD     ADC0SS3_Handler           ; ADC Sequence 3
                DCD     WDT0_Handler              ; Watchdog timer
                DCD     TIMER0A_Handler           ; Timer 0 subtimer A
                DCD     TIMER0B_Handler           ; Timer 0 subtimer B
                DCD     TIMER1A_Handler           ; Timer 1 subtimer A
                DCD     TIMER1B_Handler           ; Timer 1 subtimer B
                DCD     TIMER2A_Handler           ; Timer 2 subtimer A
                DCD     TIMER2B_Handler           ; Timer 2 subtimer B
                DCD     COMP0_Handler             ; Analog Comparator 0
                DCD     COMP1_Handler             ; Analog Comparator 1
                DCD     COMP2_Handler             ; Analog Comparator 2
                DCD     SYSCTL_Handler            ; System Control (PLL, OSC, BO)
                DCD     FLASH_Handler             ; FLASH Control
                DCD     GPIOF_Handler             ; GPIO Port F
                DCD     GPIOG_Handler             ; GPIO Port G
                DCD     GPIOH_Handler             ; GPIO Port H
                DCD     UART2_Handler             ; UART2 Rx and Tx
                DCD     SSI1_Handler              ; SSI1 Rx and Tx
                DCD     TIMER3A_Handler           ; Timer 3 subtimer A
                DCD     TIMER3B_Handler           ; Timer 3 subtimer B
                DCD     I2C1_Handler              ; I2C1 Master and Slave
                DCD     QEI1_Handler              ; Quadrature Encoder 1
                DCD     CAN0_Handler              ; CAN0
                DCD     CAN1_Handler              ; CAN1
                DCD     CAN2_Handler              ; CAN2
                DCD     ETH0_Handler              ; Ethernet
                DCD     HIB_Handler               ; Hibernate
                DCD     USB0_Handler              ; USB0
                DCD     PWM0_3_Handler            ; PWM Generator 3
                DCD     UDMA_Handler              ; uDMA Software Transfer
                DCD     UDMAERR_Handler           ; uDMA Error
                DCD     ADC1SS0_Handler           ; ADC1 Sequence 0
                DCD     ADC1SS1_Handler           ; ADC1 Sequence 1
                DCD     ADC1SS2_Handler           ; ADC1 Sequence 2
                DCD     ADC1SS3_Handler           ; ADC1 Sequence 3
                DCD     I2S0_Handler              ; I2S0
                DCD     EPI0_Handler              ; External Bus Interface 0
                DCD     GPIOJ_Handler             ; GPIO Port J

                DCD     GPIOK_Handler             ; GPIO Port K
                DCD     GPIOL_Handler             ; GPIO Port L
                DCD     SSI2_Handler              ; SSI2 Rx and Tx
                DCD     SSI3_Handler              ; SSI3 Rx and Tx
                DCD     UART3_Handler             ; UART3 Rx and Tx
                DCD     UART4_Handler             ; UART4 Rx and Tx
                DCD     UART5_Handler             ; UART5 Rx and Tx
                DCD     UART6_Handler             ; UART6 Rx and Tx
                DCD     UART7_Handler             ; UART7 Rx and Tx
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     I2C2_Handler              ; I2C2 Master and Slave
                DCD     I2C3_Handler              ; I2C3 Master and Slave
                DCD     TIMER4A_Handler           ; Timer 4 subtimer A
                DCD     TIMER4B_Handler           ; Timer 4 subtimer B
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     TIMER5A_Handler           ; Timer 5 subtimer A
                DCD     TIMER5B_Handler           ; Timer 5 subtimer B
                DCD     WTIMER0A_Handler          ; Wide Timer 0 subtimer A
                DCD     WTIMER0B_Handler          ; Wide Timer 0 subtimer B
                DCD     WTIMER1A_Handler          ; Wide Timer 1 subtimer A
                DCD     WTIMER1B_Handler          ; Wide Timer 1 subtimer B
                DCD     WTIMER2A_Handler          ; Wide Timer 2 subtimer A
                DCD     WTIMER2B_Handler          ; Wide Timer 2 subtimer B
                DCD     WTIMER3A_Handler          ; Wide Timer 3 subtimer A
                DCD     WTIMER3B_Handler          ; Wide Timer 3 subtimer B
                DCD     WTIMER4A_Handler          ; Wide Timer 4 subtimer A
                DCD     WTIMER4B_Handler          ; Wide Timer 4 subtimer B
                DCD     WTIMER5A_Handler          ; Wide Timer 5 subtimer A
                DCD     WTIMER5B_Handler          ; Wide Timer 5 subtimer B
                DCD     FPU_Handler               ; FPU
                DCD     PECI0_Handler             ; PECI 0
                DCD     LPC0_Handler              ; LPC 0
                DCD     I2C4_Handler              ; I2C4 Master and Slave
                DCD     I2C5_Handler              ; I2C5 Master and Slave
                DCD     GPIOM_Handler             ; GPIO Port M
                DCD     GPION_Handler             ; GPIO Port N
                DCD     QEI2_Handler              ; Quadrature Encoder 2
                DCD     FAN0_Handler              ; Fan 0
                DCD     0                         ; Reserved
                DCD     GPIOP0_Handler            ; GPIO Port P (Summary or P0)
                DCD     GPIOP1_Handler            ; GPIO Port P1
                DCD     GPIOP2_Handler            ; GPIO Port P2
                DCD     GPIOP3_Handler            ; GPIO Port P3
                DCD     GPIOP4_Handler            ; GPIO Port P4
                DCD     GPIOP5_Handler            ; GPIO Port P5
                DCD     GPIOP6_Handler            ; GPIO Port P6
                DCD     GPIOP7_Handler            ; GPIO Port P7
                DCD     GPIOQ0_Handler            ; GPIO Port Q (Summary or Q0)
                DCD     GPIOQ1_Handler            ; GPIO Port Q1
                DCD     GPIOQ2_Handler            ; GPIO Port Q2
                DCD     GPIOQ3_Handler            ; GPIO Port Q3
                DCD     GPIOQ4_Handler            ; GPIO Port Q4
                DCD     GPIOQ5_Handler            ; GPIO Port Q5
                DCD     GPIOQ6_Handler            ; GPIO Port Q6
                DCD     GPIOQ7_Handler            ; GPIO Port Q7
                DCD     GPIOR_Handler             ; GPIO Port R
                DCD     GPIOS_Handler             ; GPIO Port S
                DCD     PMW1_0_Handler            ; PWM 1 Generator 0
                DCD     PWM1_1_Handler            ; PWM 1 Generator 1
                DCD     PWM1_2_Handler            ; PWM 1 Generator 2
                DCD     PWM1_3_Handler            ; PWM 1 Generator 3
                DCD     PWM1_FAULT_Handler        ; PWM 1 Fault

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


